---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.Insert(Autodesk.Revit.DB.ProjectLocation)
source: html/0d2d4cc2-202c-c993-834d-4bfe0c622a89.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.Insert Method

Insert the specified project location into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	ProjectLocation item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ProjectLocation`) - The project location to be inserted into the set.

## Returns
Returns whether the project location was inserted into the set.